app/controllers/songs_controller.rb

SELECT  1 AS one FROM "artists" LIMIT 1
SELECT "artists".* FROM "artists"
---
  def new
#    binding.pry
    if params[:artist_id] && !Artist.exists?(params[:artist_id])

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1234]]
---
  def edit
  #  binding.pry
    if params[:artist_id]
      artist = Artist.find_by(id: params[:artist_id])
      if  artist.nil?
          redirect_to artists_path
      elsif !Song.exists?(params[:id])
        redirect_to artist_songs_path
      else
        @song = artist.songs.find_by(id: params[:id])